app/controllers/home_controller.rb

  def create
    @product = Products.new(params[:products])
    @email = params[:products]["email"].to_s
    if !@email.match(/^(.+)@([^\(\);:,<>]+\.[a-zA-Z]{2,4})/).nil?
      if @product.save
---
INSERT INTO `products` (`name`, `photo_file_size`, `photo_file_name`, `photo_content_type`, `photo_updated_at`, `email`) VALUES('test22', 86103, 'full2.jpg', 'image/jpeg', '2011-10-20 18:55:03', 'aranoxs@gmail.com')